
print(3+5)
print(6*4)
print(4, 5, 5+6)
print('Hello world')

#Программа - набор инструкций, который описывает компьютеру определённую последовательность действий.
#Программа выполняется сверху вниз, слева на право

#Встроенные типы объектов Python

#Типы объектов / Название типа объекта в Python / Пример объекта
#Целое число / int(от слова "integer") / 43, -56, 0, 2548
#Число с плавающей точкой (вещественные числа) / float / 1.5, -43.0, 32.5
#Строка / str (от слова "string") / "hello", 'Hello'
#Логический тип / bool (от слова "boolean") / True, False
#Список / list / [43, -54.5, True, 'Hello']
#Словарь / dict (от слова "dictionary") / {'a':123, 'b':456}
#Кортеж / tuple / (1, 2, 3, 4, 5)
#Множество / set {1,2,3,4}
#Файлы / file


#Операции над числами

#Сложение +
#вычитание -
#Умножение *
#Деление /
#Возведение в степень **
#Целочисленное деление //
#Остаток от деления %


#Приоритет операций

#В скобках (). Пример: 2*(5+2)=14
#Возведение в степень ** Пример: 3*2**3=24
#Умножение, деление, целочисленное деление, деление с остатком, имеет одинаковый приоритет, т.е. выполняется слева на право: * / // % Пример 6/3*5=10
#Плюс, минус + -, имеет одинаковый приоритет, т.е. выполняется слева на правоПример: 4-5+2=1

#
#
#
#
#
#
#
#
#
#





